Repository: advancedresearch/lojban
Catalog: assets/en-jbo.tmx
Source language: en
Languages: jbo

source: Hokkaido lies in the north of Japan.
jbo: la xokaidos cu berti lo gugdejupu

source: What if I say "no"?
jbo: ma da'i fau lo nu mi cusku zo nai

source: I'm right.
jbo: mi drani

source: I cannot understand what you say.
jbo: mi na jimpe lo se cusku be do

source: Where's my box of chocolates?
jbo: lo mi tanxe be lo cakla ma zvati

source: I can't find my pen.
jbo: mi ca'o fliba lo ka facki fi lo mi penbi

source: Walk ahead of me.
jbo: ko cadzu ca'u mi

source: Fetch me my hat.
jbo: ko cpacu lo mi mapku

source: All of my friends like soccer.
jbo: ro lo mi pendo cu nelci lo boltipterjvi

source: I could read between the lines.
jbo: mi pu kakne lo nu pe'a jufra midju tcidu

source: I'm always looking at you.
jbo: mi roroi catlu do

source: I like jazz.
jbo: mi nelci lo dja'aza

source: I'll stay home.
jbo: mi ba stali le lazyzda

source: I am concerned for your health.
jbo: mi xanka lo ni do kanro

source: I have a dictionary.
jbo: mi ralte lo vlacku

source: I'm young.
jbo: mi citno

source: I want to marry her.
jbo: mi djica lo nu mi spebi'o ko'a

source: I love her and she loves me.
jbo: mi prami je se prami ko'a

source: I have a cold.
jbo: mi vaxybi'a

source: I also like cake.
jbo: mi si'a nelci lo titnanba

source: Can you hide me from the police?
jbo: do ka'e xu mipri mi lo pulji

source: I am reading a book.
jbo: mi ca tcidu lo cukta

source: I saw my sister there.
jbo: mi pu viska lo mi mensi va

source: My sister did not say "Hello".
jbo: lo mi mensi pu na cusku zo coi

source: My sister has a job.
jbo: lo mensi be mi ku se jibri

source: My sister is clumsy, which is a disadvantage to her.
jbo: .i lo mensi be mi cu tolprali jai juxre

source: I'll make an effort to get up early every morning.
jbo: .a'i mi clira cikybi'o ca ro djedi

source: If she should come late, give her this message.
jbo: ganai lo nu ko'a klama cu lerci gi ko dunda le vi notci ko'a

source: Democracy is not exportable like food or cement.
jbo: na'e canja lo ka'irtrusi'o .enai lo cidja .abo lo xumrkonkreto

source: I'm sleepy!
jbo: .au sipna

source: Aren't you sleepy?
jbo: xu do na tatpi

source: I'm not asking for the moon.
jbo: mi na cpedu lo nu to'e cumki

source: He had one daughter.
jbo: pa da pu tixnu ra

source: My name is Ichiro Tanaka.
jbo: mi'e .iciros.tanakas

source: Life is dear to everybody.
jbo: lo nu jmive cu dirba roda

source: I hope it rains tomorrow.
jbo: carvi .a'o ti'u lo bavlamdei

source: You shall have my answer tomorrow.
jbo: lo te spuda be tu'a do cu bavlamdei

source: What time do we leave tomorrow?
jbo: ti'u ma ca lo bavlamdei mi'o cliva

source: Don't be late for school tomorrow.
jbo: ko na jai lerci fai tu'a lo ckule ca lo bavlamdei

source: Tomorrow is a holiday.
jbo: velsla ca lo bavlamdei

source: It'll snow tomorrow.
jbo: snime carvi de'i li pa

source: Beware of the dog!
jbo: kajde fi lo gerku

source: Wood floats in water.
jbo: lo mudri ku fulta lo djacu

source: I'm awake.
jbo: mi cikna

source: The eye is the mirror of the soul.
jbo: lo kanla cu minra pe'a lo ruxse'i

source: Wake up!
jbo: ko cikybi'o

source: Close your eyes, please.
jbo: do ga'orgau lo kanla be do vau .e'o

source: Don't shut your eyes.
jbo: ko na ga'orgau loi kanla

source: It was night.
jbo: pu nicte

source: Can you see in the darkness of the night?
jbo: xu do ka'e viska fi loza'i nicte manku

source: It must have rained during the night.
jbo: ja'o carvi ca lo nicte

source: It's eight o'clock at night.
jbo: li reno ca tcika

source: A promise is a promise.
jbo: lo se nupre cu ka se nupre

source: The medicine cured him of his illness.
jbo: le micyxu'i cu galfi ko'a lo ka kanro

source: I advise you not to borrow money from your friends.
jbo: .e'unai ko na jbera loi jdini lo do pendo

source: I received a letter from my friend.
jbo: mi te benji lo xatra le mi pendo

source: My friend called me a coward.
jbo: lo mi pendo cu skicu mi fo lo tolvri

source: He is going to stay at a friend's house.
jbo: ko'a stali lo zdani po lo pendo

source: Supper was laid out on the table.
jbo: vacysai sepo'i bu'u lo jubme

source: Time for dinner.
jbo: tcika lo nu vacycti

source: Could you give me back my valuables?
jbo: .e'o ko tolyle'a lo mi kargu se ponse

source: Take anything you want.
jbo: ko lebna da poi do djica

source: Your eyes are bigger than your stomach.
jbo: lo kanla be do cu zmadu lo betfu be do sekai lo ka barda

source: I'm begging you.
jbo: mi pikci do

source: There is a threat of a storm.
jbo: vilti'a selnu'e

source: My parents are away on a trip and I'm alone in our house.
jbo: lo rirni be mi zu litru .i je mi nonkansa lo nu zvati lo zdani be mi'a

source: The parents named their baby Akira.
jbo: loi rirni cu te cmene lo cifnu be ri la.akiran.

source: The food was so good that I ate too much.
jbo: lo sanmi pu kukte mutce ja'e lo nu mi citka lo duslai

source: The hounds are in pursuit of the fox.
jbo: za'u kalte gerku ku jersi pa lorxu

source: Have a nice weekend!
jbo: sai pluka jeftyfanmo di'ai

source: Find a good job.
jbo: ko xamgu bo jibri binxo

source: To love our neighbors is our duty.
jbo: lo nu prami loi jbixa'u be ma'a se bilga ma'a

source: For example, this is a pen.
jbo: mu'a ti penbi

source: For example, it is 7:00 a.m. in London now.
jbo: mu'a li ze ca tcika fo la.lyndyn.

source: For example, do you like English?
jbo: xu mu'a do nelci lo glibau

source: The cold north wind turned the leaves brown.
jbo: tu'a lo lenku berti brife cu galfi lo pezli lo bunre

source: Don't be late for the train.
jbo: ko na jai lerci fai tu'a lo trene

source: The workers are on strike.
jbo: lei gunka cu jibypante

source: Old people need someone to talk to.
jbo: lo ro slabu prenu cu nitcu lo se tavla

source: Er, Sir? What's written on the blackboard isn't an exponential function but a trigonometric one ...
jbo: ga'inai lo se ciska be fi lo bakryta'o cu sinxa lo tenfa naje cibjgacmaci fancu

source: What's up, kiddo?
jbo: ma tcini doi .i'u lo verba

source: Children should obey their parents.
jbo: .ei lo verba ku tinbe fi lo vo'a rirni

source: The ski area we finally arrived at ... snow turned to rain.
jbo: ma'a klamu'o .a'enai lo skiji cmana .i lo snime cu binxo lo carvi

source: Only Takeuchi didn't accept the invitation.
jbo: la takeutcis po'o pu na zanru lo nu cpedu lo nu vo'a vitke

source: Please put their name on everything they take with them.
jbo: pe'u do ko ciska le cmene be ko'a ro se lebna be ko'a

source: Bats are mammals, just like us.
jbo: lo volratcu cu mabru .i ma'a go'i

source: It was a dark night, with no moon.
jbo: pu manku nicte secau lo lunra

source: I'm Japanese, but I don't live in Japan.
jbo: mi ponjo gi'e ku'i na xabju lo pongu'e

source: Have I answered your question?
jbo: xu mi pu dafsku fi lo do preti

source: Which country are you from?
jbo: ma gugde do

source: Good morning!
jbo: cerni coi

source: Say hello to your mum for me.
jbo: ko cusku zo coi lo me do mamta seba'i mi

source: Can I rest a bit?
jbo: xu mi ka'e ze'i surla

source: I am French.
jbo: mi fraso

source: To those who would tear the world down: we will defeat you.
jbo: doi loi nu'o jai daspo be lo munje mi'a jinga fi do

source: My hovercraft is full of eels.
jbo: lo mi varkiclaflo'i ku culno lo angila

source: I don't know.
jbo: mi na djuno

source: I'm leaving.
jbo: mi cliva

source: When is the party?
jbo: nu salci ca ma

source: Happy birthday, Muiriel!
jbo: di'ai .miuri'el.

source: I am an entrepreneur.
jbo: mi nincu'upre

source: Who are you?
jbo: do mo

source: I really do not want to go.
jbo: mi zasti djica lo nu mi na klama

source: See you later!
jbo: co'o

source: Happy New Year!
jbo: .ui li'i nanca cfari

source: At night he goes out for a drink.
jbo: ca lo nicte ra klama mu'i lo nu ri pinxe

source: Where is this train going?
jbo: lo vi trene cu klama ma

source: Die!
jbo: le'o ro'e nai catra ko

source: He had already gone.
jbo: ko'a pu mo'u klama

source: I am a vegetarian.
jbo: mi nalre'ucti

source: We are Arabs.
jbo: mi'o xrabo

source: He is smart.
jbo: ra stati

source: You are my friend.
jbo: do pendo mi

source: My wife is a doctor.
jbo: lo speni be mi cu mikce

source: He taught me history.
jbo: ra pu ctuca mi fo lo citri

source: Where is the boy?
jbo: lo nanla ma zvati

source: Where are you from?
jbo: do to'o ma

source: Where do you live?
jbo: do xabju ma

source: You are rich.
jbo: do ricfu

source: These are birds.
jbo: ti cipni

source: He went to the shop.
jbo: ri klama le zarci

source: Where are you going to?
jbo: do klama ma

source: I'm talking about this pen, not that one over there on the desk.
jbo: mi tavla fi lo vi penbi e nai lo va co'e poi cpana lo jubme

source: "What time is it?" "It's 3:20."
jbo: ma ca tcika .i li 3 pi'e 20

source: He got up at eight in the morning.
jbo: ra co'a cikna ti'u li bi

source: It was a new book.
jbo: da pu cnino cukta

source: Really?
jbo: xu go'i

source: It was proven that fleas living on dogs jump higher than fleas living on cats.
jbo: je'urja'o lo du'u lo civla befi lo gerku cu zmadu lo civla befi lo mlatu lo ni pu'i ve plipe

source: How are you?
jbo: ma tcini do

source: Hello!
jbo: coi

source: Sawako wants to go to France.
jbo: la.sauakon. djica lo nu klama lo fasygu'e

source: I'm French.
jbo: mi fraso

source: Thank you!
jbo: ki'e do

source: What happened?
jbo: ma co'i fasnu

source: I feel hungry.
jbo: mi xagji

source: Are you ready?
jbo: xu do bredi

source: I don't understand.
jbo: mi na jimpe

source: We don't like the rain.
jbo: mi'a na nelci le carvi

source: Fine. And you?
jbo: .o'u .i pei

source: Do you speak English?
jbo: xu do se bangu lo glibau

source: Have you ever been there?
jbo: xu do ba'o va zvati

source: Do you want to go?
jbo: xu do djica lo nu klama

source: Latin is a dead language.
jbo: lo banlu'atu morsi pe'a bangu

source: He is Li Ying.
jbo: ra du la.li,in.

source: Foreigners astound me.
jbo: fange se gugde .uesai

source: Why doesn't he come back?
jbo: mu'i ma ra na se'ixru

source: I can't tell you the truth.
jbo: mi na ka'e cusku lo jetnu do

source: Nobody speaks to me.
jbo: noda tavla mi

source: It's raining cats and dogs.
jbo: mutce carvi

source: You're so beautiful!
jbo: do mutce melbi

source: I was searching for something that didn't exist.
jbo: mi pu sisku tu'a da poi nalzasti

source: I am a man.
jbo: mi nanmu

source: Do you like music?
jbo: xu do nelci lo zgike

source: Don't be late to school tomorrow.
jbo: ko na jai lerci fai tu'a lo ckule ca lo bavlamdei

source: We have three airplanes.
jbo: mi ralte ci vinji

source: Computers are complicated machines.
jbo: lo skami cu pluja minji

source: He's out taking a walk.
jbo: ra ca ca'o va cadzu

source: He is American.
jbo: ta merko

source: Nobody believes what I say.
jbo: no da krici lo se cusku be mi

source: I see a woman wearing black.
jbo: mi viska lo ninmu poi dasni lo xekri

source: This is the house where she used to live.
jbo: ti dinju gije pu zdani ra

source: Are you Chinese or Japanese?
jbo: do jungo je'i ponjo

source: She hated him.
jbo: ko'a ko'e xebni

source: Bill doesn't like the fact that his father smokes a lot.
jbo: la.bil. na nelci lo du'u lo patfu be vo'a cu mutce sigva'u

source: She was tired, but she kept working.
jbo: .i ko'a puki tatpi .i ku'i ko'a ca'o gunka

source: She was surprised when she saw the ghost.
jbo: ko'a se spaji ca lo nu zgana lo pruxi

source: He was almost hit by a car.
jbo: ra na ru'e se janli lo karce

source: She may come.
jbo: ko'a cumki klama

source: In my opinion, she is correct.
jbo: pe'i ra drani

source: It's true that she's dead.
jbo: jetnu fa lo du'u ko'a morsi

source: Certainly she is correct.
jbo: ju'o ta drani

source: Who cares when she gets married?
jbo: ma se cinri lo nu ca ma kau ra co'a speni

source: This is a wooden table.
jbo: ti mudri jubme

source: She was watching the dead leaves fall.
jbo: ko'a co'a zgana lo nu farlu fa lo morsi pezli

source: Beijing is the capital of China.
jbo: la peitcin. raltca lo gugdecunu

source: Hello, it's me, Nancy!
jbo: coi mi'e nansis

source: This is a DVD.
jbo: ti cukmirvelvei

source: Life's a ruin without you.
jbo: lo mivru'e cu mutce xlali va'o lo nu claxu do

source: Finally!
jbo: .uo

source: I know everything.
jbo: mi djuno ro da

source: The fellow is here.
jbo: lo nanmu vi zvati

source: Please.
jbo: e'o

source: I didn't know that he was there.
jbo: mi na djuno lo du'u ra zvati

source: Does it sound like I'm in love?
jbo: xu mi simlu lo ka prami

source: I love you more than I love her.
jbo: do zmadu ko'a loka mi prami

source: I know those girls.
jbo: leva nixli cu slabu mi

source: I think he's happy.
jbo: pe'i ra gleki

source: Let's go drink a cup of coffee at that coffee shop over there.
jbo: .e'u xa'emi'o pinxe loi ckafi fi'o vecnu fe'u le va kafyzarci

source: I forgot your phone number.
jbo: mi tolmo'i lo fonjudri be do

source: I didn't mean to!
jbo: mi na zukte

source: It was his habit to get up early.
jbo: ra se tcaci lo nu lo nu co'a cikna cu clira

source: You seem distant.
jbo: do simlu lo ka darno pe'a

source: He works on some really crazy projects.
jbo: ko'a gunka so'o tcecizra

source: I is an other.
jbo: mi drata

source: That house is mine.
jbo: lo va zdani cu selpo'e mi

source: Hello world!
jbo: coi munje

source: What do you want to drink?
jbo: do djica lo nu pinxe ma

source: Speaking English isn't easy.
jbo: lonu tavla fo le glibau na frili

source: I would like to go to Japan.
jbo: mi djica lo nu klama lo ponjo gugde

source: What did you do last night?
jbo: do pu zukte ma ca lo lamji nicte

source: He made a mistake and drank poison.
jbo: ko'a pu srera gi'e pinxe lo vindu

source: Guys, I gotta go.
jbo: doi rodo mi nitcu lo ka klama

source: I hear that his father is in another country.
jbo: ti'e lo patfu be ra cu zvati lo bargu'e

source: Do you understand me?
jbo: je'epei

source: Please speak slowly.
jbo: .e'o ko masno tavla

source: Do you understand?
jbo: xu do jimpe

source: You're welcome.
jbo: je'e

source: But the coffee's not good.
jbo: ku'i lo ckafi cu xlali

source: I asked him for a favor.
jbo: mi pu cpedu fi ko'a fe lo ka sidju

source: I'm not good at multitasking.
jbo: mi na certu lo nu sorzu'e

source: I've heard nothing.
jbo: mi pu tirna no da

source: I'm hungry!
jbo: mi xagji

source: She asked him for help.
jbo: ra cpedu lo nu ra sidju

source: What is happiness?
jbo: ma nu gleki

source: There is a metro in Kazan.
jbo: da cnita te trene bu'u la kazan

source: Are you at home?
jbo: xu do ca zvati lo zdani

source: I am Teochew.
jbo: mi me la tcaudjo'us

source: Tom is my friend.
jbo: la .tam. se pendo mi

source: What I've done!
jbo: oi ma mi ba'o se zukte

source: What's your name?
jbo: ma cmene do

source: Don't you have any money?
jbo: xu do ralte da poi jdini

source: "Hello, who is this?"
jbo: coi ma

source: When you wear that dress, you look like a slut.
jbo: dasni lo pastu seri'a lonu simlu loka malsorgle

source: I want to learn Chinese next year.
jbo: mi djica lo nu cilre fi lo jugbau ca lo bavlamna'a

source: I am hungry.
jbo: mi xagji

source: I am the best.
jbo: mi traji

source: I'll pay by Visa.
jbo: mi ba pleji sepi'o la'oi Visa

source: She is beautiful.
jbo: ra melbi

source: She goes to night school.
jbo: ko'a klama lo nicte ckule

source: Hey guys, please be quiet.
jbo: doi pendo e'o ko smaji binxo

source: To love life is to love God.
jbo: lonu prami lepu'u jmive cu du lonu prami la cevni

source: Kentucky screams "fuck".
jbo: la .kentykis. cu krixa zo fyk.

source: You're right.
jbo: do drani

source: You're Germans, aren't you?
jbo: do dotco vau xu

source: Are there dogs that eat raw fish?
jbo: xu da poi gerku cu citka lo narseljukpa finpe

source: She has beautiful eyes.
jbo: melbi kanla ra

source: These shoes are too small.
jbo: loi vi cutci cu dukse cmalu

source: Are you married?
jbo: xu do speni

source: One, two, three, four, five, six, seven, eight, nine, ten.
jbo: pa .i re .i ci .i vo .i mu .i xa .i ze .i bi .i so .i pano

source: What the bloody fuck is that?
jbo: .uanai .a'unai ta mo

source: Good evening, how are you?
jbo: vanci coi .i pei

source: What's this?
jbo: ti mo

source: Please put your shoes on.
jbo: .e'o ko co'a dasni lo cutci

source: I can't see anything.
jbo: mi na ka'e viska da

source: Let's have a try.
jbo: .e'u ma'a troci

source: Do you speak French?
jbo: xu do tavla fo lo fasybau

source: Both sisters are very beautiful.
jbo: lo re mensi cu mutce melbi

source: Rock, paper, scissors.
jbo: rokci ji papri ji jinci

source: Where are you going?
jbo: do klama ma

source: What did you have for lunch today?
jbo: ca lo cabdei lo dormijysai be ma cu se citka do

source: Please go at the most convenient time for you.
jbo: pe'u ko klama seti'u lo mu'e do kufra

source: Welcome to Tatoeba!
jbo: zanvi'e fi la.tatoebas.

source: You need this.
jbo: do nitcu ti

source: Long time, no see.
jbo: ze'u pu na penmi

source: These shoes are hers.
jbo: ti poi cutci cu se ralte ra

source: Today was fun.
jbo: lo cabdei pu ca'o zdile

source: I'm sorry, but I'm going home.
jbo: .u'u mi co'a klama le mi zdani

source: I returned the book to the library.
jbo: mi xruti lo cukta lo ckusro

source: My eyes are blue.
jbo: lo kanla be mi cu blanu

source: Select action for Chris.
jbo: .i ko selzu'e be la. kris. cuxna

source: Ken lit the candles.
jbo: gau la .ken. le laktergu'i cu jelca

source: Mary helped her mother cook.
jbo: la .meiris. le mamta be ri pu sidju lo nu jukpa

source: Betty is a dance teacher.
jbo: la.betis. dansu ctuca

source: Take me to your leader.
jbo: .e'o mi penmi lo do ralju gau do

source: With great power comes great responsibility.
jbo: nu binxo lo vlipa seri'a so'i se fuzme

source: That was all Greek to me.
jbo: ro ti pu itkuile ga'a mi

source: Good night!
jbo: xamgu nicte di'ai

source: I'm a nomad for life.
jbo: mi cnexa'u ze'e lo mivru'e

source: I'm unemployed.
jbo: da na le'ipli mi

source: Do you eat meat?
jbo: xu do citka lo rectu

source: What time is it?
jbo: ma ca tcika

source: Perhaps he will never be famous.
jbo: su'o ba'oi ze'e na'e misno

source: Good luck!
jbo: di'ai sai

source: Please don't speak too quickly.
jbo: e'o ko na sutra tavla

source: Be quiet!
jbo: ko smaji

source: What do you know about him?
jbo: ko'a mo

source: My father doesn't like soccer.
jbo: lo patfu be mi na nelci lo fudbolo

source: My name is Hashimoto.
jbo: mi'e xacimotos.

source: She is dead.
jbo: ra morsi

source: Cut the potatoes.
jbo: ko ka'argau lo patlu

source: To be or not to be, that is the question.
jbo: mi zasti giji na'e zasti .i di'u preti

source: Tom walks very slowly.
jbo: la .tom. masno mutce cadzu

source: How much does this cost?
jbo: ti se jdima ma

source: I'm going to bed.
jbo: mi klama lo ckana

source: I understand.
jbo: je'e

source: This is true.
jbo: .ie

source: I'm a human.
jbo: mi remna

source: You're a person.
jbo: do prenu

source: I don't have any money.
jbo: mi na ponse lo jdini

source: Please allow me to go.
jbo: e'o ko curmi lo nu mi klama

source: Please let me go.
jbo: e'o ko curmi lo nu mi klama

source: Answer my questions.
jbo: ko spuda loi mi preti

source: I can't do it either.
jbo: mi ji'a na ka'e co'e

source: Please don't ask.
jbo: e'o ko na retsku

source: I made a mistake.
jbo: mi srera

source: It's lunch time.
jbo: nu dormijysai

source: Are you hungry?
jbo: xu do xagji

source: Bartender, I'd like to have a drink.
jbo: doi barjyse'u mi djica .e'o tu'a lo se pinxe

source: Can you help me, please?
jbo: .e'o ko sidju

source: Can you help me?
jbo: pei sidju mi

source: Close your eyes.
jbo: ko ganlygau lo kanla

source: Come here quickly.
jbo: ko sutra klama ti

source: Come with me.
jbo: ko klama ka'ai mi

source: Could we meet again?
jbo: xu mi'o za'u re'u ka'e pensi'u

source: Did you like the book?
jbo: xu do pu nelci le cukta

source: Do you have a map?
jbo: xu do ralte lo cartu

source: Do you have fish at this zoo?
jbo: xu ti mivdalmuzga lo finpe

source: Do you like snow?
jbo: xu do nelci lo snime

source: Does anyone here speak English?
jbo: xu vi ku da se bangu lo glibau

source: Excuse me?
jbo: ke'o

source: Have you finished?
jbo: mu'opei

source: He likes to cook.
jbo: ra nelci lo nu jukpa

source: He likes to swim.
jbo: ra nelci lo nu limna

source: He sells fruit.
jbo: ko'a vecnu lo grute

source: He washes his hair.
jbo: ko'a lumci lo ko'a kerfa

source: He writes Arabic.
jbo: ra ciska bau lo xrabo

source: I like sports.
jbo: mi nelci lo xadykelci'e

source: I have an opinion.
jbo: mi jinvi da

source: Could I have the bill, please?
jbo: e'o ko dunda lo janta mi

source: Bon voyage!
jbo: di'ai xamgu nu litru

source: It's too large.
jbo: ra dusbarda

source: I hate coffee.
jbo: mi xebni lo ckafi

source: I dislike coffee.
jbo: mi to'e nelci lo ckafi

source: That's a good question.
jbo: cinri preti

source: Do it now.
jbo: ko ca zukte

source: It's free.
jbo: no da jdima ti

source: It's improved.
jbo: xagze'a

source: How do you know that?
jbo: do ra djuno fo ma

source: How much does it cost?
jbo: ma jdini

source: How much is the kilo of bananas?
jbo: ma jdima lo badna ki'ogra

source: How old are you?
jbo: do renvi fi ma

source: I agree.
jbo: .ie

source: I am divorced.
jbo: mi spesti

source: I am going to see where they're going.
jbo: mi ba zgana lo se klama be ko'a

source: I am in the classroom.
jbo: mi nenri lo ckule kumfa

source: I am leaving at ten o'clock.
jbo: mi cliva ti'u li pano

source: I am Lin.
jbo: mi'e .lin.

source: I am lost. Can you help me, please?
jbo: mi farcri .i xu do kakne lo ka sidju mi vau pe'u

source: I am ready.
jbo: mi bredi

source: I am sick.
jbo: mi bilma

source: I can't be without you.
jbo: mi na kakne lo nu claxu do

source: I do not sleep well.
jbo: mi na'e xamgu sipna

source: I don't know where they are.
jbo: mi na djuno lodu'u za'u ra makau zvati

source: I feel very ill.
jbo: mi mutce bilma

source: I have a wooden table.
jbo: mi ralte lo mudri jubme

source: I have brown hair.
jbo: bunre kerfa mi

source: I hope they aren't deceiving me.
jbo: mi pacna lo nu tu'a xai na tcica mi

source: I lost my wallet.
jbo: mi pu cirko lo jdini vasru

source: I shit in your milk.
jbo: mi kalcyvi'i setca fi lo do ladru

source: I teach Chinese.
jbo: mi ctuca fo lo jugbau

source: I teach English.
jbo: mi ctuca fi lo glico

source: I think I lost my wallet.
jbo: ru'a mi pu cirko lo mi dinvau

source: I want to kiss you.
jbo: .au mi cinba do

source: I want to show you a spectacular view.
jbo: mi djica lo nu jarco lo banli jvinu do

source: I wash myself.
jbo: mi lumci vo'a

source: I wear a suit but wear no tie.
jbo: mi dasni lo lityta'u .enai lo nebysrijge

source: Sauron wants every hobbit to fear him.
jbo: la sauron. djica lo nu ro me lai xobit. cu terpa sy

source: It's 18th June today, and also Muiriel's birthday!
jbo: li pabi pi'e pi'e xa ca detri .i je ri te jbena fi la.muiriel.

source: I must buy new skis.
jbo: .ei mi terve'u lo cnino skiji

source: I think we agree, the past is over.
jbo: pe'i mi'o tugni .i ba'o purci

source: We are happy.
jbo: mi'a gleki

source: Japan is the only nation to have been hit by nuclear bombs.
jbo: la pongu'e cu selte'i lo ka selda'i fi lo ratyjbama kei lo'i gugde

source: He thought that I was very tired.
jbo: ra jinvi lo du'u mi pu tatpi

source: Put the carrots in the pot.
jbo: ko punji lo najgenja lo patxu

source: Please choose one person.
jbo: e'o ko cuxna pa lo prenu

source: I would like to go to America.
jbo: .au klama la .amerik.

source: Do you want me to comb your hair?
jbo: xu do djica lo nu mi kompli lo kerfa be do

source: I'm sick!
jbo: mi bilma

source: I'm ill.
jbo: mi bilma

source: Stop!
jbo: ko sisti

source: Thanks!
jbo: ki'e

source: May I begin to eat?
jbo: e'apei mi co'a citka

source: Do you drink coffee?
jbo: pei do pinxe lo ckafi
